susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F303E.h
#define FMC_A0_PH0_ PH0,GPIO_AF12
#define _FMC_A0_PH0_ 1

#define FMC_A1_PH1_ PH1,GPIO_AF12
#define _FMC_A1_PH1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG13_ PG13,GPIO_AF12
#define _FMC_A24_PG13_ 1

#define FMC_A25_PG14_ PG14,GPIO_AF12
#define _FMC_A25_PG14_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_CD_PF9_ PF9,GPIO_AF12
#define _FMC_CD_PF9_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_INT2_PG6_ PG6,GPIO_AF12
#define _FMC_INT2_PG6_ 1

#define FMC_INT3_PG7_ PG7,GPIO_AF12
#define _FMC_INT3_PG7_ 1

#define FMC_INTR_PF10_ PF10,GPIO_AF12
#define _FMC_INTR_PF10_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NCE2_PD7_ PD7,GPIO_AF12
#define _FMC_NCE2_PD7_ 1

#define FMC_NCE3_PG9_ PG9,GPIO_AF12
#define _FMC_NCE3_PG9_ 1

#define FMC_NCE4_1_PG10_ PG10,GPIO_AF12
#define _FMC_NCE4_1_PG10_ 1

#define FMC_NCE4_2_PG11_ PG11,GPIO_AF12
#define _FMC_NCE4_2_PG11_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define _FMC_NE3_PG10_ 1

#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NIORD_PF6_ PF6,GPIO_AF12
#define _FMC_NIORD_PF6_ 1

#define FMC_NIOWR_PF8_ PF8,GPIO_AF12
#define _FMC_NIOWR_PF8_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NREG_PF7_ PF7,GPIO_AF12
#define _FMC_NREG_PF7_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define I2C1_SCL_PA15_ PA15,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA15_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA14_ PA14,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA14_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PA9_ PA9,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PF6_ PF6,GPIO_AF4
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PF6_ 1

#define I2C2_SDA_PA10_ PA10,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define _I2C2_SDA_PA10_ 1
#define _I2C2_SDA_PF0_ 1

#define I2C2_SMBA_PA8_ PA8,GPIO_AF4
#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PA8_ 1
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF3
#define _I2C3_SCL_PA8_ 1

#define I2C3_SDA_PB5_ PB5,GPIO_AF8
#define I2C3_SDA_PC9_ PC9,GPIO_AF3
#define _I2C3_SDA_PB5_ 1
#define _I2C3_SDA_PC9_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF2
#define _I2C3_SMBA_PA9_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PF1_ PF1,GPIO_AF5
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PF1_ 1

#define I2S2_MCK_PA8_ PA8,GPIO_AF5
#define I2S2_MCK_PC6_ PC6,GPIO_AF6
#define _I2S2_MCK_PA8_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PA11_ PA11,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define _I2S2_SD_PA11_ 1
#define _I2S2_SD_PB15_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PF0_ PF0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PF0_ 1

#define I2S2_ext_SD_PA10_ PA10,GPIO_AF5
#define I2S2_ext_SD_PB14_ PB14,GPIO_AF5
#define _I2S2_ext_SD_PA10_ 1
#define _I2S2_ext_SD_PB14_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PA9_ PA9,GPIO_AF5
#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PA9_ 1
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S3_ext_SD_PB4_ PB4,GPIO_AF6
#define I2S3_ext_SD_PC11_ PC11,GPIO_AF6
#define _I2S3_ext_SD_PB4_ 1
#define _I2S3_ext_SD_PC11_ 1

