susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F303E.h
#define I2S_CKIN_PA12_ PA12,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA12_ 1
#define _I2S_CKIN_PC9_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF5
#define IR_OUT_PB9_ PB9,GPIO_AF6
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_REFIN_PA1_ PA1,GPIO_AF0
#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PA1_ 1
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1

#define SPI2_MISO_PA10_ PA10,GPIO_AF5
#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define _SPI2_MISO_PA10_ 1
#define _SPI2_MISO_PB14_ 1

#define SPI2_MOSI_PA11_ PA11,GPIO_AF5
#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define _SPI2_MOSI_PA11_ 1
#define _SPI2_MOSI_PB15_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PD15_ PD15,GPIO_AF6
#define SPI2_NSS_PF0_ PF0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PD15_ 1
#define _SPI2_NSS_PF0_ 1

#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PF1_ PF1,GPIO_AF5
#define SPI2_SCK_PF10_ PF10,GPIO_AF5
#define SPI2_SCK_PF9_ PF9,GPIO_AF5
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PF1_ 1
#define _SPI2_SCK_PF10_ 1
#define _SPI2_SCK_PF9_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE5_ PE5,GPIO_AF5
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE5_ 1

#define SPI4_MOSI_PE14_ PE14,GPIO_AF5
#define SPI4_MOSI_PE6_ PE6,GPIO_AF5
#define _SPI4_MOSI_PE14_ 1
#define _SPI4_MOSI_PE6_ 1

#define SPI4_NSS_PE11_ PE11,GPIO_AF5
#define SPI4_NSS_PE3_ PE3,GPIO_AF5
#define SPI4_NSS_PE4_ PE4,GPIO_AF5
#define _SPI4_NSS_PE11_ 1
#define _SPI4_NSS_PE3_ 1
#define _SPI4_NSS_PE4_ 1

#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PE2_ PE2,GPIO_AF5
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PE2_ 1

#define SYS_JTCK_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK_SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO_TRACESWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO_TRACESWO_PB3_ 1

#define SYS_JTMS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS_SWDIO_PA13_ 1

#define SYS_NJTRST_PB4_ PB4,GPIO_AF0
#define _SYS_NJTRST_PB4_ 1

#define SYS_TRACECK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1

#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define _SYS_TRACED3_PE6_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF9
#define TIM15_BKIN_PC5_ PC5,GPIO_AF2
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PC5_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF9
#define TIM15_CH1_PB14_ PB14,GPIO_AF1
#define TIM15_CH1_PF9_ PF9,GPIO_AF3
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PF9_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF9
#define TIM15_CH1N_PB15_ PB15,GPIO_AF2
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB15_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF9
#define TIM15_CH2_PB15_ PB15,GPIO_AF1
#define TIM15_CH2_PF10_ PF10,GPIO_AF3
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PF10_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF1
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA12_ PA12,GPIO_AF1
#define TIM16_CH1_PA6_ PA6,GPIO_AF1
#define TIM16_CH1_PB4_ PB4,GPIO_AF1
#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define TIM16_CH1_PE0_ PE0,GPIO_AF4
#define _TIM16_CH1_PA12_ 1
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB4_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PA13_ PA13,GPIO_AF1
#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define _TIM16_CH1N_PA13_ 1
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF1
#define TIM17_BKIN_PB4_ PB4,GPIO_AF10
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF1
#define TIM17_CH1_PB5_ PB5,GPIO_AF10
#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define TIM17_CH1_PE1_ PE1,GPIO_AF4
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB5_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA14_ PA14,GPIO_AF6
#define TIM1_BKIN_PA15_ PA15,GPIO_AF9
#define TIM1_BKIN_PA6_ PA6,GPIO_AF6
#define TIM1_BKIN_PB12_ PB12,GPIO_AF6
#define TIM1_BKIN_PB8_ PB8,GPIO_AF12
#define TIM1_BKIN_PE15_ PE15,GPIO_AF2
#define _TIM1_BKIN_PA14_ 1
#define _TIM1_BKIN_PA15_ 1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PB8_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF12
#define TIM1_BKIN2_PC3_ PC3,GPIO_AF6
#define TIM1_BKIN2_PE14_ PE14,GPIO_AF6
#define _TIM1_BKIN2_PA11_ 1
#define _TIM1_BKIN2_PC3_ 1
#define _TIM1_BKIN2_PE14_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF6
#define TIM1_CH1_PC0_ PC0,GPIO_AF2
#define TIM1_CH1_PE9_ PE9,GPIO_AF2
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PC0_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA11_ PA11,GPIO_AF6
#define TIM1_CH1N_PA7_ PA7,GPIO_AF6
#define TIM1_CH1N_PB13_ PB13,GPIO_AF6
#define TIM1_CH1N_PC13_ PC13,GPIO_AF4
#define TIM1_CH1N_PE8_ PE8,GPIO_AF2
#define _TIM1_CH1N_PA11_ 1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PC13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF6
#define TIM1_CH2_PC1_ PC1,GPIO_AF2
#define TIM1_CH2_PE11_ PE11,GPIO_AF2
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PC1_ 1
#define _TIM1_CH2_PE11_ 1

