susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32F303E.h
#define TIM1_CH2N_PA12_ PA12,GPIO_AF6
#define TIM1_CH2N_PB0_ PB0,GPIO_AF6
#define TIM1_CH2N_PB14_ PB14,GPIO_AF6
#define TIM1_CH2N_PE10_ PE10,GPIO_AF2
#define _TIM1_CH2N_PA12_ 1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF6
#define TIM1_CH3_PC2_ PC2,GPIO_AF2
#define TIM1_CH3_PE13_ PE13,GPIO_AF2
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PC2_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF6
#define TIM1_CH3N_PB15_ PB15,GPIO_AF4
#define TIM1_CH3N_PE12_ PE12,GPIO_AF2
#define TIM1_CH3N_PF0_ PF0,GPIO_AF6
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1
#define _TIM1_CH3N_PF0_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF11
#define TIM1_CH4_PC3_ PC3,GPIO_AF2
#define TIM1_CH4_PE14_ PE14,GPIO_AF2
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PC3_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF11
#define TIM1_ETR_PC4_ PC4,GPIO_AF2
#define TIM1_ETR_PE7_ PE7,GPIO_AF2
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PC4_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM20_BKIN_PF7_ PF7,GPIO_AF2
#define TIM20_BKIN_PF9_ PF9,GPIO_AF2
#define TIM20_BKIN_PG3_ PG3,GPIO_AF2
#define _TIM20_BKIN_PF7_ 1
#define _TIM20_BKIN_PF9_ 1
#define _TIM20_BKIN_PG3_ 1

#define TIM20_BKIN2_PF10_ PF10,GPIO_AF2
#define TIM20_BKIN2_PF8_ PF8,GPIO_AF2
#define TIM20_BKIN2_PG4_ PG4,GPIO_AF2
#define _TIM20_BKIN2_PF10_ 1
#define _TIM20_BKIN2_PF8_ 1
#define _TIM20_BKIN2_PG4_ 1

#define TIM20_CH1_PE2_ PE2,GPIO_AF6
#define TIM20_CH1_PF12_ PF12,GPIO_AF2
#define TIM20_CH1_PH0_ PH0,GPIO_AF2
#define _TIM20_CH1_PE2_ 1
#define _TIM20_CH1_PF12_ 1
#define _TIM20_CH1_PH0_ 1

#define TIM20_CH1N_PE4_ PE4,GPIO_AF6
#define TIM20_CH1N_PF4_ PF4,GPIO_AF3
#define TIM20_CH1N_PG0_ PG0,GPIO_AF2
#define _TIM20_CH1N_PE4_ 1
#define _TIM20_CH1N_PF4_ 1
#define _TIM20_CH1N_PG0_ 1

#define TIM20_CH2_PE3_ PE3,GPIO_AF6
#define TIM20_CH2_PF13_ PF13,GPIO_AF2
#define TIM20_CH2_PH1_ PH1,GPIO_AF2
#define _TIM20_CH2_PE3_ 1
#define _TIM20_CH2_PF13_ 1
#define _TIM20_CH2_PH1_ 1

#define TIM20_CH2N_PE5_ PE5,GPIO_AF6
#define TIM20_CH2N_PF5_ PF5,GPIO_AF2
#define TIM20_CH2N_PG1_ PG1,GPIO_AF2
#define _TIM20_CH2N_PE5_ 1
#define _TIM20_CH2N_PF5_ 1
#define _TIM20_CH2N_PG1_ 1

#define TIM20_CH3_PF14_ PF14,GPIO_AF2
#define TIM20_CH3_PF2_ PF2,GPIO_AF2
#define _TIM20_CH3_PF14_ 1
#define _TIM20_CH3_PF2_ 1

#define TIM20_CH3N_PE6_ PE6,GPIO_AF6
#define TIM20_CH3N_PG2_ PG2,GPIO_AF2
#define _TIM20_CH3N_PE6_ 1
#define _TIM20_CH3N_PG2_ 1

#define TIM20_CH4_PE1_ PE1,GPIO_AF6
#define TIM20_CH4_PF15_ PF15,GPIO_AF2
#define TIM20_CH4_PF3_ PF3,GPIO_AF2
#define _TIM20_CH4_PE1_ 1
#define _TIM20_CH4_PF15_ 1
#define _TIM20_CH4_PF3_ 1

#define TIM20_ETR_PE0_ PE0,GPIO_AF6
#define TIM20_ETR_PF11_ PF11,GPIO_AF2
#define TIM20_ETR_PG5_ PG5,GPIO_AF2
#define _TIM20_ETR_PE0_ 1
#define _TIM20_ETR_PF11_ 1
#define _TIM20_ETR_PG5_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define TIM2_CH1_PD3_ PD3,GPIO_AF2
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PD3_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define TIM2_CH2_PD4_ PD4,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1
#define _TIM2_CH2_PD4_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PA9_ PA9,GPIO_AF10
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define TIM2_CH3_PD7_ PD7,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PA9_ 1
#define _TIM2_CH3_PB10_ 1
#define _TIM2_CH3_PD7_ 1

#define TIM2_CH4_PA10_ PA10,GPIO_AF10
#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define TIM2_CH4_PD6_ PD6,GPIO_AF2
#define _TIM2_CH4_PA10_ 1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1
#define _TIM2_CH4_PD6_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define TIM2_ETR_PD3_ PD3,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PD3_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define TIM3_CH1_PE2_ PE2,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE2_ 1

#define TIM3_CH2_PA4_ PA4,GPIO_AF2
#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define TIM3_CH2_PE3_ PE3,GPIO_AF2
#define _TIM3_CH2_PA4_ 1
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE3_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define TIM3_CH3_PE4_ PE4,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE4_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PB7_ PB7,GPIO_AF10
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define TIM3_CH4_PE5_ PE5,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PB7_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE5_ 1

#define TIM3_ETR_PB3_ PB3,GPIO_AF10
#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PB3_ 1
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PA11_ PA11,GPIO_AF10
#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PA11_ 1
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PA12_ PA12,GPIO_AF10
#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PA12_ 1
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PA13_ PA13,GPIO_AF10
#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PA13_ 1
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define TIM4_CH4_PF6_ PF6,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1
#define _TIM4_CH4_PF6_ 1

#define TIM4_ETR_PA8_ PA8,GPIO_AF10
#define TIM4_ETR_PB3_ PB3,GPIO_AF2
#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PA8_ 1
#define _TIM4_ETR_PB3_ 1
#define _TIM4_ETR_PE0_ 1

#define TIM8_BKIN_PA0_ PA0,GPIO_AF9
#define TIM8_BKIN_PA10_ PA10,GPIO_AF11
#define TIM8_BKIN_PA6_ PA6,GPIO_AF4
#define TIM8_BKIN_PB7_ PB7,GPIO_AF5
#define TIM8_BKIN_PD2_ PD2,GPIO_AF4
#define _TIM8_BKIN_PA0_ 1
#define _TIM8_BKIN_PA10_ 1
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PB7_ 1
#define _TIM8_BKIN_PD2_ 1

#define TIM8_BKIN2_PB6_ PB6,GPIO_AF10
#define TIM8_BKIN2_PC9_ PC9,GPIO_AF6
#define TIM8_BKIN2_PD1_ PD1,GPIO_AF6
#define _TIM8_BKIN2_PB6_ 1
#define _TIM8_BKIN2_PC9_ 1
#define _TIM8_BKIN2_PD1_ 1

